spring-ws-core/src/test/resources/org/springframework/ws/soap/addressing/10/request-no-to.xml

<S:Envelope xmlns:S="https://www.w3.org/2003/05/soap-envelope" xmlns:wsa="https://www.w3.org/2005/08/addressing">
    <S:Header>
        <wsa:Action>https://example.com/fabrikam/mail/Delete</wsa:Action>
        <wsa:MessageID>https://example.com/someuniquestring</wsa:MessageID>
    </S:Header>
    <S:Body>
        <f:Delete xmlns:f="https://example.com/fabrikam">
            <f:maxCount>42</f:maxCount>
        </f:Delete>
    </S:Body>
</S:Envelope>
